{
    "format": "layers-model",
    "generatedBy": "keras v2.2.5",
    "convertedBy": "TensorFlow.js Converter v1.4.0",
    "modelTopology": {
        "keras_version": "2.2.5",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_3",
                "layers": [
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_13",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                250,
                                250,
                                3
                            ],
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_13",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_13",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_14",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_14",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_14",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_15",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_15",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_15",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_16",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_16",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_16",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_17",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_17",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_17",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_18",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_18",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_18",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_3",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_7",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 512,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_8",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 512,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_3",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_9",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 2,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "lr": 0.0010000000474974513,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "decay": 0.0,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            },
            "loss": "categorical_crossentropy",
            "metrics": [
                "accuracy"
            ],
            "weighted_metrics": null,
            "sample_weight_mode": null,
            "loss_weights": null
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "batch_normalization_13/gamma",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_13/beta",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_13/moving_mean",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_13/moving_variance",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_14/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_14/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_14/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_14/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_15/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_15/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_15/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_15/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_16/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_16/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_16/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_16/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_17/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_17/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_17/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_17/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_18/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_18/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_18/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_18/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_13/kernel",
                    "shape": [
                        3,
                        3,
                        3,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_13/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_14/kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_14/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_15/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_15/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_16/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_16/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_17/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_17/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_18/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_18/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_7/kernel",
                    "shape": [
                        64,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_7/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_8/kernel",
                    "shape": [
                        512,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_8/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_9/kernel",
                    "shape": [
                        512,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_9/bias",
                    "shape": [
                        2
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}